package com.sunline.ccs.param.def.enums;

import com.sunline.ark.support.meta.EnumInfo;

@EnumInfo({
	"Gen_002|检验卡片是否黑名单",
	"Gen_003|检验商户黑名单",
	"Gen_004|检验cvv是否为加密机错",
	"Gen_005|检验cvv2是否为加密机错",
	"Gen_006|检验cavv是否为加密机错",
	"Gen_007|icvn加密机错验证",
	"Gen_008|arqc加密机错验证",
	"Gen_009|密码加密机错验证",
	"Ter_001|检验交易终端",
	"Mer_001|检查moto消费交易限制",
	"Mer_002|检查电子类消费交易限制",
	"Mer_003|检查分期消费交易限制",
	"Mer_004|检查大额分期消费交易限制",
	"Mer_005|检查是否支持moto消费交易",
	"Mer_006|检查是否支持电子类消费交易",
	"Mer_007|检查是否支持分期消费交易",
	"Mer_008|检查是否支持大额分期消费交易",
	"Ass_001|辅助验证密码检查未上送",
	"Ass_002|辅助验证有效期检查未上送",
	"Ass_003|辅助验证身份证检查未上送",
	"Ass_004|辅助验证磁道检查未上送",
	"Ass_005|辅助验证委托关系检查不支持",
	"Ass_006|辅助验证cvn2检查未上送",
	"Ass_007|辅助验证Pvn检查不支持",
	"Ass_008|辅助验证姓名检查未上送",
	"Ass_009|辅助验证姓名检查不相等",
	"Ass_010|辅助验证手机号码检查未上送",
	"Ass_011|辅助验证手机号码检查不相等",
	"Ass_012|辅助验证动态码检查不支持",
	"Ass_013|辅助验证身份证检查不相等",
	"Ass_014|关联交易的账户验证不得上送密码有效期cvv2",
	"Ass_015|账户验证必须上送辅助验证信息",
	"Ass_016|账户验证上送正确的身份证后6位数字关联订购（不允许上送密码）",
	"Ass_017|代付手输无密无磁必须上送61域否则拒绝",
	"Ass_018|建立委托必须上送CVV2和有效期",
	"Ass_019|批量代付姓名或证件号码后6位必须上送一个",
	"Ass_020|无卡建立委托必须上送CVV2和有效期",
	"Ass_021|有卡建立委托或辅助消费验证密码是否存在",
	"Ass_022|银联无卡自助自主/辅助模式下消费/预授权交易必须上送有效期",//AIC2.7银联升级
	"Ass_023|银联无卡自助自主模式下消费/预授权交易必须上送动态验证码或通讯号码",//AIC2.7银联升级
	"Ass_024|银联moto类消费/预授权交易必须上送有效期",//AIC2.7银联升级
	"Ccm_001|检查针对国家的交易限制",
	"Ccm_002|检查针对国家的本币单笔交易限额",
	"Ccm_003|检查针对国家的外币单笔交易限额",
	"Ccm_004|检查针对币种的交易限制",
	"Ccm_005|检查针对MCC的交易限制",
	"Ccm_006|检查针对MCC的本币单笔交易限额",
	"Ccm_007|检查针对MCC的外币单笔交易限额",
	"Ccm_008|检查国家/币种/mcc是否禁止此组合交易",
	"Ccm_009|检查国家/币种/mcc的本币单笔交易限额",
	"Ccm_010|检查国家/币种/mcc的外币单笔交易限额",
	"Cro_001|卡号检验",
	"Cro_002|IC卡一致性05/95存在检查",
	"Cro_003|IC卡一致性07/98存在检查",
	"Cro_004|卡序列号检查",
	"Cro_005|ATM必须存在密码",
	"Cro_006|禁止柜台ATM的消费",
	"Cro_007|48域合法性检查",
	"Cro_008|消费取现交易金额检查",
	"Cro_009|交易金额及入账金额必须非负",
	"Cro_010|6域51域组合校验",
	"Cro_011|非查询交易的49域校验",
	"Cro_012|MPS报文格式错",
	"Ic_001|禁止fallback交易",
	"Ic_002|icvn验证",
	"Ic_003|arqc错验证",
	"Ic_004|arqc未上送验证",
	"Ic_005|atc验证",
	"Ic_006|cvr验证",
	"Ic_007|tvr验证",
	"Otb_001|账户可用额验证",
	"Otb_002|客户可用额验证",
	"Otb_003|逻辑卡消费限额验证",
	"Otb_004|[取现]账户取现可用额验证",
	"Otb_005|[取现]逻辑卡单笔取现限额验证",
	"Otb_006|逻辑卡网银消费限额验证",
	"Otb_007|[转出]账户溢缴款取现可用额度验证",
	"Otb_008|[分期]账户分期可用额度",
	"Otb_009|[贷记撤销]借记账户负OTB控制",
	"Otb_010|[贷记冲正]借记账户负OTB控制",
	"Otb_011|[预授权完成撤销]账户负OTB控制",
	"Otb_012|[预授权完成冲正]账户负OTB控制",
	"Otb_013|[预授权完成]账户OTB控制",
	"Resp_001|拒绝行动码修正",
	"Resp_002|通过行动码修正",
	"Resp_003|没收行动码修正",
	"Sec_001|逻辑卡上密码错次数超限验证",
	"Sec_002|消费免验密码",
	"Sec_003|查询免验密码",
	"Sec_004|二磁道验证",
	"Sec_005|一磁道验证",
	"Sec_006|三磁道验证",
	"Sec_007|凭密消费密码验证",
	"Sec_008|银联有卡自助 强制验证启用",
	"Sec_009|无卡消费电子类密码验证",
	"Sec_010|分期消费密码验证",
	"Sec_011|ATM交易密码验证",
	"Sec_012|取现密码验证",
	"Sec_013|CVV验证",
	"Sec_014|cvv2验证",
	"Sec_015|moto交易商户强制验证cvv2但未上送验证",
	"Sec_016|产品参数强制验证moto手工类交易cvv2",
	"Sec_017|产品参数强制验证moto电子类交易cvv2",
	"Sec_018|产品参数人工授权强制验证cvv2",
	"Sec_019|逻辑卡上查询密码错次数超限验证",
	"Sec_020|辅助验证姓名检查不相等",
	"Sec_021|CVV是否锁定",
	"Sec_022|ICVN是否锁定",
	"Sec_023|CVV2是否锁定",
	"Sec_024|密码是否存在",
	"Stat_001|检查逻辑卡激活状态",
	"Stat_002|检查介质卡有效期不匹配",
	"Stat_003|检查介质卡有效期过期",
	"Stat_004|检查介质卡激活状态",
	"Rsn_001|交易/终端渠道交叉检查",
	"Rsn_002|无卡自助开通检查",
	"Vel_001|[消费]当期消费金额检查",
	"Vel_002|[取现]当期取现金额检查",
	"Vel_003|[消费]当期网银交易金额检查",
	"Vel_004|单日ATM取现限额检查",
	"Vel_005|单日ATM取现限笔检查",
	"Vel_006|单日取现限额检查",
	"Vel_007|单日取现限笔检查",
	"Vel_008|单日消费限额检查",
	"Vel_009|单日消费限笔检查",
	"Vel_010|银联境外单日atm取现检查",
	"Csa_001|账户是否包含非待销户账户锁定码",
	"Csa_002|结清金额是否正确",
	"Loan_001|检查分期交易期数验证",
	"Loan_002|检查分期交易金额验证",
	"Loan_003|检查分期活动状态验证",
	"Loan_004|检查分期活动有效期验证",
	"Loan_005|检查发卡分行是否支持",
	"Loan_006|检查卡产品是否支持",
	"Loan_007|检查商户类型是否支持",
	"Loan_008|检查商户号是否支持",
	"Loan_009|检查附卡是否支持",
	"Loan_010|检查motoemotopos渠道的分期交易是否支持",
	"Loan_011|检查商户分期状态",
	"Loan_012|检查商户分期交易金额",
	"Mcr_001|逾期期数或六个月内逾期次数达标不允许使用",
	"Mcr_002|不超过贷款授信有效期",
	"Mcr_003|最大最小金额限额",
	"Mcr_004|客户小额贷可用额验证",
	"Mcr_005|小额贷产品有效期验证",
	"Mcr_006|小额贷产品状态验证",
	"Cust_001|转账还款收款人姓名校验"
	})
public enum AuthCheckPoint {
	/**
	 * 检验卡片是否黑名单
	 */
	Gen_002,
	/**
	 * 检验商户黑名单
	 */
	Gen_003,
	/**
	 * 检验cvv是否为加密机错
	 */
	Gen_004,
	/**
	 * 检验cvv2是否为加密机错
	 */
	Gen_005,
	/**
	 * 检验cavv是否为加密机错
	 */
	Gen_006,
	/**
	 * icvn加密机错验证
	 */
	Gen_007,
	/**
	 * arqc加密机错验证
	 */
	Gen_008,
	/**
	 * 密码加密机错验证
	 */
	Gen_009,
	/**
	 * 检验交易终端
	 */
	Ter_001,
	/**
	 * 检查moto消费交易限制
	 */
	Mer_001,
	/**
	 * 检查电子类消费交易限制
	 */
	Mer_002,
	/**
	 * 检查分期消费交易限制
	 */
	Mer_003,
	/**
	 * 检查大额分期消费交易限制
	 */
	Mer_004,
	/**
	 * 检查是否支持moto消费交易
	 */
	Mer_005,
	/**
	 * 检查是否支持电子类消费交易
	 */
	Mer_006,
	/**
	 * 检查是否支持分期消费交易
	 */
	Mer_007,
	/**
	 * 检查是否支持大额分期消费交易
	 */
	Mer_008,
	/**
	 * 辅助验证密码检查未上送
	 */
	Ass_001,
	/**
	 * 辅助验证有效期检查未上送
	 */
	Ass_002,
	/**
	 * 辅助验证身份证检查未上送
	 */
	Ass_003,
	/**
	 * 辅助验证磁道检查未上送
	 */
	Ass_004,
	/**
	 * 辅助验证委托关系检查不支持
	 */
	Ass_005,
	/**
	 * 辅助验证cvn2检查未上送
	 */
	Ass_006,
	/**
	 * 辅助验证Pvn检查不支持
	 */
	Ass_007,
	/**
	 * 辅助验证姓名检查未上送
	 */
	Ass_008,
	/**
	 * 辅助验证姓名检查不相等
	 */
	Ass_009,
	/**
	 * 辅助验证手机号码检查未上送
	 */
	Ass_010,
	/**
	 * 辅助验证手机号码检查不相等
	 */
	Ass_011,
	/**
	 * 辅助验证动态码检查不支持
	 */
	Ass_012,
	/**
	 * 辅助验证身份证检查不相等
	 */
	Ass_013,
	/**
	 * 关联交易的账户验证不得上送密码有效期cvv2
	 */
	Ass_014,
	/**
	 * 账户验证必须上送辅助验证信息
	 */
	Ass_015,
	/**
	 * 账户验证上送正确的身份证后6位数字关联订购（不允许上送密码）
	 */
	Ass_016,
	/**
	 * 代付手输无密无磁必须上送61域否则拒绝
	 */
	Ass_017,
	/**
	 * 建立委托必须上送CVV2和有效期
	 */
	Ass_018,
	/**
	 * 批量代付姓名或证件号码后6位必须上送一个
	 */
	Ass_019,
	/**
	 * 无卡建立委托必须上送CVV2和有效期
	 */
	Ass_020,
	/**
	 * 有卡建立委托或辅助消费验证密码是否存在
	 */
	Ass_021,
	/**
	 * 银联无卡自助自主/辅助模式下消费/预授权交易必须上送有效期
	 * AIC2.7银联升级
	 */
	Ass_022,
	/**
	 * 银联无卡自助自主模式下消费/预授权交易必须上送动态验证码或通讯号码
	 * AIC2.7银联升级
	 */
	Ass_023,
	/**
	 * 银联moto类消费/预授权交易必须上送有效期
	 * AIC2.7银联升级
	 */
	Ass_024,
	/**
	 * 检查针对国家的交易限制
	 */
	Ccm_001,
	/**
	 * 检查针对国家的本币单笔交易限额
	 */
	Ccm_002,
	/**
	 * 检查针对国家的外币单笔交易限额
	 */
	Ccm_003,
	/**
	 * 检查针对币种的交易限制
	 */
	Ccm_004,
	/**
	 * 检查针对MCC的交易限制
	 */
	Ccm_005,
	/**
	 * 检查针对MCC的本币单笔交易限额
	 */
	Ccm_006,
	/**
	 * 检查针对MCC的外币单笔交易限额
	 */
	Ccm_007,
	/**
	 * 检查国家/币种/mcc是否禁止此组合交易
	 */
	Ccm_008,
	/**
	 * 检查国家/币种/mcc的本币单笔交易限额
	 */
	Ccm_009,
	/**
	 * 检查国家/币种/mcc的外币单笔交易限额
	 */
	Ccm_010,
	/**
	 * 卡号检验
	 */
	Cro_001,
	/**
	 * IC卡一致性05/95存在检查
	 */
	Cro_002,
	/**
	 * IC卡一致性07/98存在检查
	 */
	Cro_003,
	/**
	 * 卡序列号检查
	 */
	Cro_004,
	/**
	 * ATM必须存在密码
	 */
	Cro_005,
	/**
	 * 禁止柜台ATM的消费
	 */
	Cro_006,
	/**
	 * 48域合法性检查
	 */
	Cro_007,
	/**
	 * 消费取现交易金额检查
	 */
	Cro_008,
	/**
	 * 交易金额及入账金额必须非负
	 */
	Cro_009,
	/**
	 * 6域51域组合校验
	 */
	Cro_010,
	/**
	 * 非查询交易的49域校验
	 */
	Cro_011,
	/**
	 * MPS报文格式错
	 */
	Cro_012,
	/**
	 * 禁止fallback交易
	 */
	Ic_001,
	/**
	 * icvn验证
	 */
	Ic_002,
	/**
	 * arqc错验证
	 */
	Ic_003,
	/**
	 * arqc未上送验证
	 */
	Ic_004,
	/**
	 * atc验证
	 */
	Ic_005,
	/**
	 * cvr验证
	 */
	Ic_006,
	/**
	 * tvr验证
	 */
	Ic_007,
	/**
	 * 账户可用额验证
	 */
	Otb_001,
	/**
	 * 客户可用额验证
	 */
	Otb_002,
	/**
	 * 逻辑卡消费限额验证
	 */
	Otb_003,
	/**
	 * [取现]账户取现可用额验证
	 */
	Otb_004,
	/**
	 * [取现]逻辑卡单笔取现限额验证
	 */
	Otb_005,
	/**
	 * 逻辑卡网银消费限额验证
	 */
	Otb_006,
	/**
	 * [转出]账户溢缴款取现可用额度验证
	 */
	Otb_007,
	/**
	 * [分期]账户分期可用额度
	 */
	Otb_008,
	/**
	 * [贷记撤销]借记账户负OTB控制
	 */
	Otb_009,
	/**
	 * [贷记冲正]借记账户负OTB控制
	 */
	Otb_010,
	/**
	 * [预授权完成撤销]账户负OTB控制
	 */
	Otb_011,
	/**
	 * [预授权完成冲正]账户负OTB控制
	 */
	Otb_012,
	/**
	 * [预授权完成]账户OTB控制
	 */
	Otb_013,
	/**
	 * 拒绝行动码修正
	 */
	Resp_001,
	/**
	 * 通过行动码修正
	 */
	Resp_002,
	/**
	 * 没收行动码修正
	 */
	Resp_003,
	/**
	 * 逻辑卡上密码错次数超限验证
	 */
	Sec_001,
	/**
	 * 消费免验密码
	 */
	Sec_002,
	/**
	 * 查询免验密码
	 */
	Sec_003,
	/**
	 * 二磁道验证
	 */
	Sec_004,
	/**
	 * 一磁道验证
	 */
	Sec_005,
	/**
	 * 三磁道验证
	 */
	Sec_006,
	/**
	 * 凭密消费密码验证
	 */
	Sec_007,
	/**
	 * 银联有卡自助 强制验证启用
	 */
	Sec_008,
	/**
	 * 无卡消费电子类密码验证
	 */
	Sec_009,
	/**
	 * 分期消费密码验证
	 */
	Sec_010,
	/**
	 * ATM交易密码验证
	 */
	Sec_011,
	/**
	 * 取现密码验证
	 */
	Sec_012,
	/**
	 * CVV验证
	 */
	Sec_013,
	/**
	 * cvv2验证
	 */
	Sec_014,
	/**
	 * moto交易商户强制验证cvv2但未上送验证
	 */
	Sec_015,
	/**
	 * 产品参数强制验证moto手工类交易cvv2
	 */
	Sec_016,
	/**
	 * 产品参数强制验证moto电子类交易cvv2
	 */
	Sec_017,
	/**
	 * 产品参数人工授权强制验证cvv2
	 */
	Sec_018,
	/**
	 * 逻辑卡上查询密码错次数超限验证
	 */
	Sec_019,
	/**
	 * 辅助验证姓名检查不相等
	 */
	Sec_020,
	/**
	 * CVV是否锁定
	 */
	Sec_021,
	/**
	 * ICVN是否锁定
	 */
	Sec_022,
	/**
	 * CVV2是否锁定
	 */
	Sec_023,
	/**
	 * 密码是否存在
	 */
	Sec_024,
	/**
	 * 检查逻辑卡激活状态
	 */
	Stat_001,
	/**
	 * 检查介质卡有效期不匹配
	 */
	Stat_002,
	/**
	 * 检查介质卡有效期过期
	 */
	Stat_003,
	/**
	 * 检查介质卡激活状态
	 */
	Stat_004,
	/**
	 * 交易/终端渠道交叉检查
	 */
	Rsn_001,
	/**
	 * 无卡自助开通检查
	 */
	Rsn_002,
	/**
	 * [消费]当期消费金额检查
	 */
	Vel_001,
	/**
	 * [取现]当期取现金额检查
	 */
	Vel_002,
	/**
	 * [消费]当期网银交易金额检查
	 */
	Vel_003,
	/**
	 * 单日ATM取现限额检查
	 */
	Vel_004,
	/**
	 * 单日ATM取现限笔检查
	 */
	Vel_005,
	/**
	 * 单日取现限额检查
	 */
	Vel_006,
	/**
	 * 单日取现限笔检查
	 */
	Vel_007,
	/**
	 * 单日消费限额检查
	 */
	Vel_008,
	/**
	 * 单日消费限笔检查
	 */
	Vel_009,
	/**
	 * 银联境外单日atm取现检查
	 */
	Vel_010,
	/**
	 * 检查分期交易期数验证
	 */
	Loan_001,
	/**
	 * 检查分期交易金额验证
	 */
	Loan_002,
	/**
	 * 检查分期活动状态验证
	 */
	Loan_003,
	/**
	 * 检查分期活动有效期验证
	 */
	Loan_004,
	/**
	 * 检查发卡分行是否支持
	 */
	Loan_005,
	/**
	 * 检查卡产品是否支持
	 */
	Loan_006,
	/**
	 * 检查商户类型是否支持
	 */
	Loan_007,
	/**
	 * 检查商户号是否支持
	 */
	Loan_008,
	/**
	 * 检查附卡是否支持
	 */
	Loan_009,
	/**
	 * 检查moto/emoto/pos渠道的分期交易是否支持
	 */
	Loan_010,
	/**
	 * 检查商户分期状态
	 */
	Loan_011,
	/**
	 * 检查商户分期交易金额
	 */
	Loan_012,
	/**
	 * 账户是否包含非待销户账户锁定码
	 */
	Csa_001,
	/**
	 * 结清金额是否正确
	 */
	Csa_002,
	/**
	 * 逾期期数或六个月内逾期次数达标不允许使用
	 */
	Mcr_001,
	/**
	 * 不超过贷款授信有效期
	 */
	Mcr_002,
	/**
	 * 小额贷最大最小金额限额
	 */
	Mcr_003,
	/**
	 * 客户小额贷可用额验证
	 */
	Mcr_004,
	/**
	 * 小额贷产品有效期验证
	 */
	Mcr_005,
	/**
	 * 小额贷产品状态验证
	 */
	Mcr_006,
	/**
	 * 行内转账还款收款人姓名校验
	 * @since 2.5.0
	 */
	Cust_001
}
