package com.sunline.ccs.param.def.enums;

import com.sunline.ark.support.meta.EnumInfo;

/**
 * 内部交易代码
* @author fanghj
 *
 */
@EnumInfo({
	"S01|分期转出",
	"S02|分期转入",
	"S03|贷款服务费",
	"S04|超限费",
	"S05|滞纳金",
	"S06|利息",
	"S07|短信费",
	"S11|约定还款",
    "S12|消费计划贷调交易代码",
    "S13|TRANSFER OUT分期计划的借调交易代码",
    "S14|积分调整交易代码",
    "S15|积分增加交易代码",
    "S16|积分兑换交易代码",
    "S17|年费金融交易代码",
    "S18|结转转出交易代码",
    "S19|结转转入交易代码",
    "S20|银联发卡方应收手续费",
    "S21|银联发卡方应付手续费",
    "S22|取现利息",
    "S23|消费利息",
    "S24|分期转出利息",
    "S25|分期转入利息",
    "S26|溢缴款利息",
    "S27|行内发卡方应收手续费",
    "S28|账单转分期贷调交易",
    "S29|账单转分期借调交易",
    "S30|分户账统计交易",
    "S31|本行借记交易挂账",
    "S32|本行贷记交易挂账",
    "S33|银联借记交易挂账",
    "S34|银联贷记交易挂账",
    "S35|商户分期手续费退货",
    "S36|现金分期交易",
    "S37|提前还款手续费",
    "S38|展期手续费",
    "S39|分期商户手续费",
    "S40|商户分期交易",
    "S41|借记贷记卡承诺",
    "S42|贷记贷记卡承诺",
    "S43|罚息利息入账",
    "S44|复利利息入账",
    "S46|贷款利息入账",
    "S51|贷款本金转出",
    "S52|贷款本金转入",
    "S53|贷款利息转出",
    "S54|贷款利息转入",
    "S55|小额贷款展期手续费",
    "S56|小额贷款缩期手续费",
	"S57|指定借据主动还款",
	"S58|非指定借据主动还款",
	"S59|第三方发卡方应收手续费",
	"S60|第三方发卡方应付手续费",
	"S61|第三方借记交易挂账",
	"S62|第三方贷记交易挂账",
	"S63|准备金计提",
	"S64|准备金解缴",
	"S65|呆账核销",
	"S66|公务卡报销",
	"S67|小额贷款提前还款手续费",
	"S68|V卡捐献交易",
	"S69|年费减免",
	"S79|V卡捐献退回",
	"S99|行内发卡方应付手续费",
	"S70|保险费",
	"S71|印花税",
	"S72|寿险计划包费",
	"S73|贷款罚金",
	"S74|罚金回溯",
	"S75|保费贷调",
	"S76|寿险计划包费贷调",
	"S77|提前还款手续费分成备忘",
	"S92|第三方理赔",
	"S93|第三方逾期扣款",
	"S94|第三方正常扣款",
	"S95|第三方结清扣款",
	"S96|逾期提前结清或者理赔利息回溯",
	"S97|印花税备忘交易",
	"S98|利息转印花税备忘交易",
	"S10|滞纳金贷调",
	"S78|分期手续费贷调",
	"S80|随借随还贷款放款",
	"S81|等额本息(金)贷款放款",
	"C01|交易费贷调",
	"C02|年费贷调",
	"C03|贷款利息贷调",
	"C05|贷款罚息贷调",
	"C07|等额本息(金)本金贷调",
	"C08|随借随还本金贷调",
	"S91|PTP扣款",
	"D09|代收付服务费入账",
	"C09|代收付服务费贷调",
	"D01|溢缴款转出",
	"D10|等额本息滞纳金入账",
	"C10|等额本息滞纳金贷调",
	"D12|代收罚金入账",
	"D13|代收罚息入账",
	"D14|代收滞纳金入账",
	"D15|代收提前还款手续费入账",
	"C12|代收罚金贷调",
	"C13|代收等额本息罚息贷调",
	"C15|代收滞纳金贷调",
	"C16|代收提前还款手续费贷调",
	"S82|趸交费转入",
	"D11|趸交费结算还款",
	"C17|灵活还款计划包贷调",
	"D17|灵活还款计划包入账",
	"C18|随借随还优惠券抵扣",
	"C20|等额本息优惠券抵扣"
})
public enum SysTxnCd {
	/**
	 * 分期转出
	 */
	S01,
	/**
	 * 分期转入
	 */
	S02,
	/**
	 * （原）分期手续费
	 * 贷款服务费
	 */
	S03,
	/**
	 * 超限费
	 */
	S04,
	/**
	 * 滞纳金
	 */
	S05,
	/**
	 * 利息
	 */
	S06,
	/**
	 * 短信费
	 */
	S07,
	/**
	 * 约定还款
	 */
	S11,
    /**
     * 消费计划贷调交易代码
     */
    S12, 
    /**
     *  TRANSFER OUT分期计划的借调交易代码
     */
    S13,
    /**
     * 积分调整交易代码
     */
    S14,
    /**
     * 积分增加交易代码
     */
    S15,
    /**
     * 积分兑换交易代码
     */
    S16,
    /**
     * 年费金融交易代码
     */
    S17,
    /**
     * 结转转出交易代码
     */
    S18,
    /**
     * 结转转入交易代码
     */
    S19,
    /**
     * 银联发卡方应收手续费
     */
    S20,
    /**
     * 银联发卡方应付手续费
     */
    S21,
    /**
     * 取现利息
     */
    S22,
    /**
     * 消费利息
     */
    S23,
    /**
     * 分期转出利息
     */
    S24,
    /**
     * 分期转入利息
     */
    S25,
    /**
     * 溢缴款利息
     */
    S26,
    /**
     * 行内发卡方应收手续费
     */
    S27,
    /**
     * 账单转分期贷调交易
     */
    S28,
    /**
     * 账单转分期借调交易
     */
    S29,
    /**
     * 分户账统计交易
     */
    S30,
    /**
     * 本行借记交易挂账
     */
    S31,
    /**
     * 本行贷记交易挂账
     */
    S32,
    /**
     * 银联借记交易挂账
     */
    S33,
    /**
     * 银联贷记交易挂账
     */
    S34,
    /**
	 * 商户分期手续费退货
	 */
	S35,
	/**
	 * 现金分期交易
	 */
	S36,
	/**
	 * 提前还款手续费
	 */
	S37,
	/**
	 * 展期手续费
	 */
	S38,
	/**
	 * 分期商户手续费
	 */
	S39,
	/**
	 * 商户分期交易
	 */
	S40,
	/**
	 * 借记贷记卡承诺
	 */
	S41,
	/**
	 * 贷记贷记卡承诺 
	 */
	S42,
	/**
	 * 罚息利息入账
	 */
	S43,
	/**
	 * 复利利息入账
	 */
	S44,
	/**
	 * 贷款利息入账
	 */
	S46,
	/**
	 * 贷款本金转出
	 */
	S51,
	/**
	 * 贷款本金转入
	 */
	S52,
	/**
	 * 贷款利息转出
	 */
	S53,
	/**
	 * 贷款利息转入
	 */
	S54,
	/**
	 * 小额贷款展期手续费
	 */
	S55,
	/**
	 * 小额贷款缩期手续费
	 */
	S56,
	/**
	 * 指定借据主动还款
	 */
	S57,
	/**
	 * 非指定借据主动还款
	 */
	S58,
	/**
	 * 第三方发卡方应收手续费
	 */
	S59,
	/**
	 * 第三方发卡方应付手续费
	 */
	S60,
	/**
	 * 第三方借记交易挂账
	 */
	S61,
	/**
	 * 第三方贷记交易挂账
	 */
	S62,
	/**
	 * 准备金计提
	 */
	S63,
	/**
	 * 准备金解缴
	 */
	S64,
	/**
	 * 呆账核销
	 */
	S65,
	/**
	 * 公务卡报销
	 */
	S66,
	/**
	 * 小额贷款提前还款手续费
	 */
	S67,
	/**
	 * V卡捐献交易
	 */
	S68,
	/**
	 * 年费减免
	 */
	S69,
	/**
	 * V卡捐献退回
	 */
	S79,
	/**
	 * 
     * 行内发卡方应付手续费
     */
	S99,
	/**
	 * 保险费
	 */
	S70,
	/**
	 * 印花税
	 */
	S71,
	/**
	 * 寿险计划包费
	 */
	S72,
	/**
	 * 贷款罚金
	 */
	S73,
	/**
	 * 等额本息(金)罚金贷调
	 */
	S74,
	/**
	 * 等额本息(金)保费贷调
	 */
	S75,
	/**
	 * 寿险计划包费贷调
	 */
	S76,
	/**
	 * 提前还款手续费分成备忘
	 */
	S77,
	/**
	 * 第三方理赔
	 */
	S92,
	/**
	 * 第三方逾期扣款
	 */
	S93,
	/**
	 * 第三方正常扣款
	 */
	S94,
	/**
	 * 第三方结清扣款
	 */
	S95,
	/**
	 * 逾期提前结清或者理赔利息回溯
	 */
	S96,
	/**
	 * 印花税备忘交易
	 */
	S97,
	/**
	 * 利息转印花税备忘交易
	 */
	S98,
	/**
	 * 随借随还滞纳金贷调
	 */
	S10,
	/**
	 * （原）服务费贷调
	 * 分期手续费贷调
	 */
	S78,
	/**
	 * 随借随还贷款放款
	 */
	S80,
	/**
	 * 等额本息(金)贷款放款
	 */
	S81,
	/**
	 * 交易费贷调
	 */
	C01,
	/**
	 * 年费贷调
	 */
	C02,
	/**
	 * 贷款利息贷调
	 */
	C03,
	/**
	 * 贷款罚息贷调
	 */
	C05,
	/**
	 * 等额本息(金)本金贷调
	 */
	C07,
	/**
	 * 随借随还本金贷调
	 */
	C08,
	/**
	 * ptp扣款
	 */
	S91,
	/**
	 * 代收付服务费入账
	 */
	D09,
	/**
	 * 代收付服务费贷调
	 */
	C09,
	/**
	 * 溢缴款转出
	 */
	D01,
	/**
	 * 等额本息滞纳金入账
	 */
	D10,
	/**
	 * 等额本息滞纳金贷调
	 */
	C10,
	
	//兜底产品
	/**
	 * 趸交费转入
	 */
	S82,
	/**
	 * 趸交费结算还款
	 */
	D11,
	/**
	 * 代收罚金入账D12
	 */
	D12,
	/**
	 * 代收罚息入账D13
	 */
	D13,
	/**
	 * 代收滞纳金入账D14
	 */
	D14,
	/**
	 * 代收提前还款手续费入账
	 */
	D15,
	/**
	 * 代收罚金贷调C12
	 */
	C12,
	/**
	 * 代收等额本息罚息贷调C13
	 */
	C13,
	/**
	 * 代收滞纳金贷调C15
	 */
	C15,
	/**
	 * 代收提前还款手续费贷调C16
	 */
	C16,
	/**
	 * 灵活还款计划包回溯C17
	 */
	C17,
	/**
	 * 灵活还款计划包入账
	 */
	D17,
	/**
	 * 随借随还优惠券入账（抵扣利息）
	 */
	C18,
	/**
	 * 等额本息优惠券入账（抵扣利息）
	 */
	C20
}
